wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_enet.h
/***********************************************************************************************************************
    @file     reg_enet.h
    @author   VV TEAM
    @brief    This flie contains all the ENET's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_ENET_H
#define __REG_ENET_H


/* Files includes ----------------------------------------------------------------------------------------------------*/
#include "core_starmc1.h"

////////////////////////////////////////////////////////////////////////////////
/// @brief IWDG Base Address Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_BASE                        (AHB1PERIPH_BASE + 0x8000) ///< Base Address: 0x40028000

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH Register Structure Definition
////////////////////////////////////////////////////////////////////////////////
typedef struct
{
    __IO uint32_t MACCR;               ///< configuration register                         offset 0x0000

    union
    {
        __IO uint32_t MACAFR;          ///< frame filter register                          offset 0x0004
        __IO uint32_t MACFFR;
    };

    __IO uint32_t MACHTHR;             ///< Hash list high register                        offset 0x0008
    __IO uint32_t MACHTLR;             ///< Hash list low register                         offset 0x000C

    union
    {
        __IO uint32_t MACSMIAR;        ///< MII address register                           offset 0x0010
        __IO uint32_t MACMIIAR;
    };
    union
    {
        __IO uint32_t MACSMIDR;        ///< MII data register                              offset 0x0014
        __IO uint32_t MACMIIDR;
    };

    __IO uint32_t MACFCR;              ///< flow control register                          offset 0x0018

    union
    {
        __IO uint32_t MACVLTRR;        ///< VLAN label register                            offset 0x001C
        __IO uint32_t MACVLANTR;
    };

    __IO uint32_t RESERVED0x0020[1];   ///< Reserved                                       offset 0x0020
    __IO uint32_t MACSR;               ///< MAC Status Register                            offset 0x0024

    union
    {
        __IO uint32_t PMTRWFR;         ///< MAC Remote Wakeup Frame FilterRegister         offset 0x0028
        __IO uint32_t MACRWUFFR;
    };
    union
    {
        __IO uint32_t PMTCR;           ///< MAC PMT Control Register                       offset 0x002C
        __IO uint32_t MACPMTCSR;
    };

    __IO uint32_t RESERVED0x0030[2];   ///< Reserved                                       offset 0x0030 ~ 0x0034
    __IO uint32_t MACISR;              ///< MAC Interrupt Status Register                  offset 0x0038
    __IO uint32_t MACIMR;              ///< MAC Interrupt Mask Register                    offset 0x003C
    __IO uint32_t MACA0HR;             ///< address 0 high register                        offset 0x0040
    __IO uint32_t MACA0LR;             ///< address 0 low register                         offset 0x0044
    __IO uint32_t MACA1HR;             ///< address 1 high register                        offset 0x0048
    __IO uint32_t MACA1LR;             ///< address 1 low register                         offset 0x004C
    __IO uint32_t MACA2HR;             ///< address 2 high register                        offset 0x0050
    __IO uint32_t MACA2LR;             ///< address 2 low register                         offset 0x0054
    __IO uint32_t MACA3HR;             ///< address 3 high register                        offset 0x0058
    __IO uint32_t MACA3LR;             ///< address 3 low register                         offset 0x005C
    __IO uint32_t MACA4HR;             ///< address 4 high register                        offset 0x0060
    __IO uint32_t MACA4LR;             ///< address 4 low register                         offset 0x0064
    __IO uint32_t MACA5HR;             ///< address 5 high register                        offset 0x0068
    __IO uint32_t MACA5LR;             ///< address 5 low register                         offset 0x006C
    __IO uint32_t RESERVED0x0070[36];  ///< Reserved                                       offset 0x0070 ~ 0x00FC
    __IO uint32_t MMCCR;               ///< MMC controls registers                         offset 0x0100

    union
    {
        __IO uint32_t MMCRSR;          ///< MMC Receive Status Register                    offset 0x0104
        __IO uint32_t MMCRSIR;
    };
    union
    {
        __IO uint32_t MMCTSR;          ///< MMC Transmit Status Register                   offset 0x0108
        __IO uint32_t MMCTSIR;
    };
    union
    {
        __IO uint32_t MMCRIR;          ///< MMC Receive Interrupt Register                 offset 0x010C
        __IO uint32_t MMCRIMR;
    };
    union
    {
        __IO uint32_t MMCTIR;          ///< MMC Transmit Interrupt Register                offset 0x0110
        __IO uint32_t MMCTIMR;
    };

    __IO uint32_t RESERVED0x0114[14];  ///< Reserved                                       offset 0x0114 ~ 0x0148

    union
    {
        __IO uint32_t MMCTGSCR;        ///< MMC Receive Interrupt Register                 offset 0x014C
        __IO uint32_t MMCTGFSCCR;      ///< A good frame counter register that MMC sends after a single conflict
    };
    union
    {
        __IO uint32_t MMCTGMCR;        ///< MMC Transmit Interrupt Register                 offset 0x0150
        __IO uint32_t MMCTGFMSCCR;     ///< A good frame counter register that MMC sends after multiple collisions
    };

    __IO uint32_t RESERVED0x0154[5];   ///< Reserved                                        offset 0x0154 ~ 0x0164

    union
    {
        __IO uint32_t MMCTGR;          ///< MMC Transfer Good Frame Counter Register        offset 0x0168
        __IO uint32_t MMCTGFCR;
    };

    __IO uint32_t RESERVED0x016C[10];  ///< Reserved                                        offset 0x016C ~ 0x0190

    union
    {
        __IO uint32_t MMCRCRCER;       ///< MMC Receive CRC Error Frame Counter Register    offset 0x0194
        __IO uint32_t MMCRFCECR;
    };
    union
    {
        __IO uint32_t MMCRALIER;       ///< MMC Receive Align Error Frame Counter Register  offset 0x0198
        __IO uint32_t MMCRFAECR;
    };

    __IO uint32_t RESERVED0x019C[10];  ///< Reserved                                        offset 0x019C ~ 0x01C0

    union
    {
        __IO uint32_t MMCRUGR;         ///< MMC Transmit Interrupt Register                 offset 0x01C4
        __IO uint32_t MMCRGUFCR;
    };

