wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_enet.h
    __IO uint32_t RESERVED0x01C8[239]; ///< Reserved                                        offset 0x01C8 ~ 0x0580
    __IO uint32_t MACVLTTR;            ///< MAC VLAN TAG Transmit Register                  offset 0x0584
    __IO uint32_t MACVLHTR;            ///< MAC VLAN HASH Table Register                    offset 0x0588
    __IO uint32_t RESERVED0x058C[69];  ///< Reserved                                        offset 0x058C ~ 0x069C
    __IO uint32_t PTPCR;               ///< PTP Control Register                            offset 0x0700
    __IO uint32_t PTPNSAR;             ///< PTP Nanosecond Addend Register                  offset 0x0704
    __IO uint32_t PTPSBSR;             ///< PTP Nanosecond Addend Register                  offset 0x0708
    __IO uint32_t PTPSNSR;             ///< PTP System Nanosecond Register                  offset 0x070C
    __IO uint32_t PTPUBSR;             ///< PTP Update Base Second Register                 offset 0x0710
    __IO uint32_t PTPUNSR;             ///< PTP Update Nanosecond Register                  offset 0x0714
    __IO uint32_t PTPBSAR;             ///< PTP Basic Addend Register                       offset 0x0718
    __IO uint32_t PTPTBSR0;            ///< PTP Basic Addend Register                       offset 0x071C
    __IO uint32_t PTPTNSR0;            ///< Automatic negotiation of broadcast registers    offset 0x0720
    __IO uint32_t RESERVED0x0724[1];   ///< Reserved                                        offset 0x0724
    __IO uint32_t PTPSR;               ///< Automatic negotiation of broadcast registers    offset 0x0728
    __IO uint32_t PTPPPSR;             ///< Automatic negotiation of the status register    offset 0x072C
    __IO uint32_t RESERVED0x0730[20];  ///< Reserved                                        offset 0x0730 ~ 0x077C
    __IO uint32_t PTPTBSR1;            ///< Automatic negotiation of broadcast registers    offset 0x0780
    __IO uint32_t PTPTNSR1;            ///< Automatic negotiation of the status register    offset 0x0784
    __IO uint32_t RESERVED0x0788[542]; ///< Reserved                                        offset 0x0788 ~ 0x0FFC

    union
    {
        __IO uint32_t DMABSR;          ///< Bus mode register                               offset 0x1000
        __IO uint32_t DMABMR;
    };
    union
    {
        __IO uint32_t DMATXPDR;        ///< DMA sends the polling request register          offset 0x1004
        __IO uint32_t DMATPDR;
    };
    union
    {
        __IO uint32_t DMARXPDR;        ///< DMA receives the polling request register       offset 0x1008
        __IO uint32_t DMARPDR;
    };
    union
    {
        __IO uint32_t DMARXDSAR;       ///< DMA receives a list of descriptor addresses     offset 0x100C
        __IO uint32_t DMARDLAR;
    };
    union
    {
        __IO uint32_t DMATXDSAR;       ///< DMA sends the descriptor list address           offset 0x1010
        __IO uint32_t DMATDLAR;
    };

    __IO uint32_t DMASR;               ///< DMA status register                             offset 0x1014

    union
    {
        __IO uint32_t DMAMDR;          ///< DMA working mode register                       offset 0x1018
        __IO uint32_t DMAOMR;
    };
    union
    {
        __IO uint32_t DMAIR;           ///< DMA interrupt enablement register               offset 0x101C
        __IO uint32_t DMAIER;
    };
    union
    {
        __IO uint32_t DMAFLCR;         ///< DMA lost frames and cache overflow counter registers offset 0x1020
        __IO uint32_t DMAMFBOCR;
    };
    union
    {
        __IO uint32_t DMAWDTR;         ///< DMA interrupt enablement register               offset 0x1024
        __IO uint32_t DMARSWTR;
    };

    __IO uint32_t RESERVED0x1028[8];   ///< DMA interrupt enablement register               offset 0x1028 ~ 0x1044

    union
    {
        __IO uint32_t DMACURTXDSAR;    ///< DMA lost frames and cache overflow counter registers    offset 0x1048
        __IO uint32_t DMACHTDR;
    };
    union
    {
        __IO uint32_t DMACURRXDSAR;    ///< DMA interrupt enablement register               offset 0x104C
        __IO uint32_t DMACHRDR;
    };
    union
    {
        __IO uint32_t DMACURTXBFAR;    ///< DMA lost frames and cache overflow counter registers     offset 0x1050
        __IO uint32_t DMACHTBAR;
    };
    union
    {
        __IO uint32_t DMACURRXBFAR;    ///< DMA interrupt enablement register               offset 0x1054
        __IO uint32_t DMACHRBAR;
    };
} ETH_TypeDef;

#define ETH                                    ((ETH_TypeDef *)ETH_BASE)

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACCR_SAIRC_Pos                    (28)
#define ETH_MACCR_SAIRC                        (0x07U << ETH_MACCR_SAIRC_Pos) //< SA Insert Replace Control
#define ETH_MACCR_CST_Pos                      (25)
#define ETH_MACCR_CST                          (0x01U << ETH_MACCR_CST_Pos)   //< CRC Strip
#define ETH_MACCR_WTD_Pos                      (23)
#define ETH_MACCR_WTD                          (0x01U << ETH_MACCR_WTD_Pos)   ///< Watchdog disable
#define ETH_MACCR_JAB_Pos                      (22)
#define ETH_MACCR_JAB                          (0x01U << ETH_MACCR_JAB_Pos)   ///< Jabber disable
#define ETH_MACCR_IFG_Pos                      (17)                           ///< Inter-frame gap
#define ETH_MACCR_IFG_96Bit                    (0x00U << ETH_MACCR_IFG_Pos)   ///< Minimum IFG between frames during transmission is 96Bit
#define ETH_MACCR_IFG_88Bit                    (0x01U << ETH_MACCR_IFG_Pos)   ///< Minimum IFG between frames during transmission is 88Bit
#define ETH_MACCR_IFG_80Bit                    (0x02U << ETH_MACCR_IFG_Pos)   ///< Minimum IFG between frames during transmission is 80Bit
#define ETH_MACCR_IFG_72Bit                    (0x03U << ETH_MACCR_IFG_Pos)   ///< Minimum IFG between frames during transmission is 72Bit
#define ETH_MACCR_IFG_64Bit                    (0x04U << ETH_MACCR_IFG_Pos)   ///< Minimum IFG between frames during transmission is 64Bit
#define ETH_MACCR_IFG_56Bit                    (0x05U << ETH_MACCR_IFG_Pos)   ///< Minimum IFG between frames during transmission is 56Bit
#define ETH_MACCR_IFG_48Bit                    (0x06U << ETH_MACCR_IFG_Pos)   ///< Minimum IFG between frames during transmission is 48Bit
#define ETH_MACCR_IFG_40Bit                    (0x07U << ETH_MACCR_IFG_Pos)   ///< Minimum IFG between frames during transmission is 40Bit
#define ETH_MACCR_MCRS_Pos                     (16)
#define ETH_MACCR_MCRS                         (0x01U << ETH_MACCR_MCRS_Pos)  ///< Mask Carrier Sense
#define ETH_MACCR_RDIS_Pos                     (13)
#define ETH_MACCR_RDIS                         (0x01U << ETH_MACCR_RDIS_Pos)  ///< Receive disable
#define ETH_MACCR_LM_Pos                       (12)
#define ETH_MACCR_LM                           (0x01U << ETH_MACCR_LM_Pos)    ///< loopback mode
#define ETH_MACCR_DM_Pos                       (11)
#define ETH_MACCR_DM                           (0x01U << ETH_MACCR_DM_Pos)    ///< Duplex mode
#define ETH_MACCR_IPCO_Pos                     (10)
#define ETH_MACCR_IPCO                         (0x01U << ETH_MACCR_IPCO_Pos)  ///< IP Checksum offload
#define ETH_MACCR_RETY_Pos                     (9)
#define ETH_MACCR_RETY                         (0x01U << ETH_MACCR_RETY_Pos)  ///< Retry Transfer
#define ETH_MACCR_APCS_Pos                     (7)
#define ETH_MACCR_APCS                         (0x01U << ETH_MACCR_APCS_Pos)  ///< Automatic CRC/PAD Strip
#define ETH_MACCR_BL_Pos                       (5)                            ///< Back-off limit: random integer number (r) of slot time delays before rescheduling a transmission attempt during retries after a collision: 0 =< r <2^k
#define ETH_MACCR_BL                           (0x03U << ETH_MACCR_BL_Pos)
#define ETH_MACCR_BL_10                        (0x00U << ETH_MACCR_BL_Pos)    ///< k = min (n, 10)
#define ETH_MACCR_BL_8                         (0x01U << ETH_MACCR_BL_Pos)    ///< k = min (n, 8)
#define ETH_MACCR_BL_4                         (0x02U << ETH_MACCR_BL_Pos)    ///< k = min (n, 4)
#define ETH_MACCR_BL_1                         (0x03U << ETH_MACCR_BL_Pos)    ///< k = min (n, 1)
#define ETH_MACCR_DLYC_Pos                     (4)
#define ETH_MACCR_DLYC                         (0x01U << ETH_MACCR_DLYC_Pos)  ///< Delay Check
#define ETH_MACCR_TE_Pos                       (3)
#define ETH_MACCR_TE                           (0x01U << ETH_MACCR_TE_Pos)    ///< Transmitter enable
#define ETH_MACCR_RE_Pos                       (2)
#define ETH_MACCR_RE                           (0x01U << ETH_MACCR_RE_Pos)    ///< Receiver enable

//legacy define
#define ETH_MACCR_WD_Pos                       ETH_MACCR_WTD_Pos
#define ETH_MACCR_WD                           ETH_MACCR_WTD
#define ETH_MACCR_JD_Pos                       ETH_MACCR_JAB_Pos
#define ETH_MACCR_JD                           ETH_MACCR_JAB
#define ETH_MACCR_ROD_Pos                      ETH_MACCR_RDIS_Pos
#define ETH_MACCR_ROD                          ETH_MACCR_RDIS
#define ETH_MACCR_RD_Pos                       ETH_MACCR_RETY_Pos
#define ETH_MACCR_RD                           ETH_MACCR_RETY
#define ETH_MACCR_DC_Pos                       ETH_MACCR_DLYC_Pos
#define ETH_MACCR_DC                           ETH_MACCR_DLYC

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACFFR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACFFR_RALL_Pos                    (31)
#define ETH_MACFFR_RALL                        (0x01U << ETH_MACFFR_RALL_Pos) ///< Receive all
#define ETH_MACFFR_DNTU_Pos                    (21)
#define ETH_MACFFR_DNTU                        (0x01U << ETH_MACFFR_DNTU_Pos) ///< Dropped no-TCP/UDP
#define ETH_MACFFR_VLTF_Pos                    (16)
#define ETH_MACFFR_VLTF                        (0x01U << ETH_MACFFR_VLTF_Pos) ///< VLAN TAG Filter
#define ETH_MACFFR_HPF_Pos                     (10)
#define ETH_MACFFR_HPF                         (0x01U << ETH_MACFFR_HPF_Pos)  ///< Hash/Perfect Filter
#define ETH_MACFFR_SAF_Pos                     (9)
#define ETH_MACFFR_SAF                         (0x01U << ETH_MACFFR_SAF_Pos)  ///< Source address filter enable
#define ETH_MACFFR_SAIF_Pos                    (8)
#define ETH_MACFFR_SAIF                        (0x01U << ETH_MACFFR_SAIF_Pos) ///< SA inverse filtering
#define ETH_MACFFR_PCF_Pos                     (6)
#define ETH_MACFFR_PCF                         (0x03U << ETH_MACFFR_PCF_Pos)  ///< Pass control frames: 3 cases
#define ETH_MACFFR_PCF_BlockAll                (0x01U << ETH_MACFFR_PCF_Pos)  ///< MAC filters all control frames from reaching the application
#define ETH_MACFFR_PCF_ForwardAll              (0x02U << ETH_MACFFR_PCF_Pos)  ///< MAC forwards all control frames to application even if they fail the Address Filter
#define ETH_MACFFR_PCF_ForwardPassedAddrFilter (0x03U << ETH_MACFFR_PCF_Pos)  ///< MAC forwards control frames that pass the Address Filter.
#define ETH_MACFFR_BCF_Pos                     (5)
#define ETH_MACFFR_BCF                         (0x01U << ETH_MACFFR_BCF_Pos)  ///< Broadcast frame disable
#define ETH_MACFFR_MCF_Pos                     (4)
#define ETH_MACFFR_MCF                         (0x01U << ETH_MACFFR_MCF_Pos)  ///< Multicast Frame Filter
#define ETH_MACFFR_DAIF_Pos                    (3)
#define ETH_MACFFR_DAIF                        (0x01U << ETH_MACFFR_DAIF_Pos) ///< DA Inverse filtering
#define ETH_MACFFR_HM_Pos                      (2)
#define ETH_MACFFR_HM                          (0x01U << ETH_MACFFR_HM_Pos)   ///< Hash multicast
#define ETH_MACFFR_HU_Pos                      (1)
#define ETH_MACFFR_HU                          (0x01U << ETH_MACFFR_HU_Pos)   ///< Hash unicast
#define ETH_MACFFR_PM_Pos                      (0)
#define ETH_MACFFR_PM                          (0x01U << ETH_MACFFR_PM_Pos)   ///< Promiscuous mode

//legacy define
#define ETH_MACFFR_RA_Pos                      ETH_MACFFR_RALL_Pos
#define ETH_MACFFR_RA                          ETH_MACFFR_RALL
#define ETH_MACFFR_BFD_Pos                     ETH_MACFFR_BCF_Pos
#define ETH_MACFFR_BFD                         ETH_MACFFR_BCF
#define ETH_MACFFR_PAM_Pos                     ETH_MACFFR_MCF_Pos
#define ETH_MACFFR_PAM                         ETH_MACFFR_MCF

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACHTHR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACHTHR_MACHTABH                   (0xFFFFFFFFU) ///< Hash table high
//legacy define
#define ETH_MACHTHR_HTH                        ETH_MACHTHR_MACHTABH

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACHTLR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACHTLR_MACHTABL                   (0xFFFFFFFFU) ///< Hash table low
//legacy define
#define ETH_MACHTLR_HTL                        ETH_MACHTLR_MACHTABL

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACMIIAR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACMIIAR_SMIADD_Pos                (11)
#define ETH_MACMIIAR_SMIADD                    (0x1FU << ETH_MACMIIAR_SMIADD_Pos) ///< SMI Address
#define ETH_MACMIIAR_SMIREG_Pos                (6)
#define ETH_MACMIIAR_SMIREG                    (0x1FU << ETH_MACMIIAR_SMIREG_Pos) ///< SMI Reg
#define ETH_MACMIIAR_SMICLK_Pos                (2)
#define ETH_MACMIIAR_SMICLK                    (0x07U << ETH_MACMIIAR_SMICLK_Pos) ///< SMI Clock
#define ETH_MACMIIAR_SMICLK_Div42              (0x00U << ETH_MACMIIAR_SMICLK_Pos) ///< HCLK:60-100 MHz; MDC clock= HCLK/42
#define ETH_MACMIIAR_SMICLK_Div62              (0x01U << ETH_MACMIIAR_SMICLK_Pos) ///< HCLK:100-150 MHz; MDC clock= HCLK/62
#define ETH_MACMIIAR_SMICLK_Div16              (0x02U << ETH_MACMIIAR_SMICLK_Pos) ///< HCLK:20-35 MHz; MDC clock= HCLK/16
#define ETH_MACMIIAR_SMICLK_Div26              (0x03U << ETH_MACMIIAR_SMICLK_Pos) ///< HCLK:35-60 MHz; MDC clock= HCLK/26

