wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_enet.h
#define ETH_MACMIIAR_SMIWR_Pos                 (1)
#define ETH_MACMIIAR_SMIWR                     (0x01U << ETH_MACMIIAR_SMIWR_Pos)  ///< SMI Write
#define ETH_MACMIIAR_SMIBY_Pos                 (0)
#define ETH_MACMIIAR_SMIBY                     (0x01U << ETH_MACMIIAR_SMIBY_Pos)  ///< SMI Busy

//legacy define
#define ETH_MACMIIAR_PA_Pos                    ETH_MACMIIAR_SMIADD_Pos
#define ETH_MACMIIAR_PA                        ETH_MACMIIAR_SMIADD
#define ETH_MACMIIAR_MR_Pos                    ETH_MACMIIAR_SMIREG_Pos
#define ETH_MACMIIAR_MR                        ETH_MACMIIAR_SMIREG
#define ETH_MACMIIAR_CR_Pos                    ETH_MACMIIAR_SMICLK_Pos
#define ETH_MACMIIAR_CR                        ETH_MACMIIAR_SMICLK
#define ETH_MACMIIAR_CR_Div42                  ETH_MACMIIAR_SMICLK_Div42
#define ETH_MACMIIAR_CR_Div62                  ETH_MACMIIAR_SMICLK_Div62
#define ETH_MACMIIAR_CR_Div16                  ETH_MACMIIAR_SMICLK_Div16
#define ETH_MACMIIAR_CR_Div26                  ETH_MACMIIAR_SMICLK_Div26
#define ETH_MACMIIAR_MW_Pos                    ETH_MACMIIAR_SMIWR_Pos
#define ETH_MACMIIAR_MW                        ETH_MACMIIAR_SMIWR
#define ETH_MACMIIAR_MB_Pos                    ETH_MACMIIAR_SMIBY_Pos
#define ETH_MACMIIAR_MB                        ETH_MACMIIAR_SMIBY

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACMIIDR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACMIIDR_SMIDATA                   (0x0000FFFFU) ///< SMI Data: read/write data from/to PHY
//legacy define
#define ETH_MACMIIDR_MD                        ETH_MACMIIDR_SMIDATA

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACFCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACFCR_PSET_Pos                    (16)
#define ETH_MACFCR_PSET                        ((uint32_t)0xFFFF << ETH_MACFCR_PSET_Pos) ///< Pause Time Setting
#define ETH_MACFCR_DZQP_Pos                    (7)
#define ETH_MACFCR_DZQP                        ((uint32_t)0xFFFF << ETH_MACFCR_DZQP_Pos) ///< Disable Zero-Quanta Pause Frame
#define ETH_MACFCR_PLT_Pos                     (4)
#define ETH_MACFCR_PLT                         (0x03U << ETH_MACFCR_PLT_Pos)             ///< Pause low threshold: 4 cases
#define ETH_MACFCR_PLT_Minus4                  (0x00U << ETH_MACFCR_PLT_Pos)             ///< Pause time minus 4 slot times
#define ETH_MACFCR_PLT_Minus28                 (0x01U << ETH_MACFCR_PLT_Pos)             ///< Pause time minus 28 slot times
#define ETH_MACFCR_PLT_Minus144                (0x02U << ETH_MACFCR_PLT_Pos)             ///< Pause time minus 144 slot times
#define ETH_MACFCR_PLT_Minus256                (0x03U << ETH_MACFCR_PLT_Pos)             ///< Pause time minus 256 slot times
#define ETH_MACFCR_UPF_Pos                     (3)
#define ETH_MACFCR_UPF                         (0x01U << ETH_MACFCR_UPF_Pos)             ///< Unicast Pause Frame
#define ETH_MACFCR_FRE_Pos                     (2)
#define ETH_MACFCR_FRE                         (0x01U << ETH_MACFCR_FRE_Pos)             ///< Flow Control Receive Enable
#define ETH_MACFCR_FTE_Pos                     (1)
#define ETH_MACFCR_FTE                         (0x01U << ETH_MACFCR_FTE_Pos)             ///< Transmit flow control enable
#define ETH_MACFCR_FCBBPA_Pos                  (0)
#define ETH_MACFCR_FCBBPA                      (0x01U << ETH_MACFCR_FCBBPA_Pos)          ///< Flow control busy/backpressure activate

//legacy define
#define ETH_MACFCR_PT_Pos                      ETH_MACFCR_PSET_Pos
#define ETH_MACFCR_PT                          ETH_MACFCR_PSET
#define ETH_MACFCR_UPFD_Pos                    ETH_MACFCR_UPF_Pos
#define ETH_MACFCR_UPFD                        ETH_MACFCR_UPF
#define ETH_MACFCR_RFCE_Pos                    ETH_MACFCR_FRE_Pos
#define ETH_MACFCR_RFCE                        ETH_MACFCR_FRE
#define ETH_MACFCR_TFCE_Pos                    ETH_MACFCR_FTE_Pos
#define ETH_MACFCR_TFCE                        ETH_MACFCR_FTE

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACVLTRR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACVLTRR_VTHM_Pos                  (19)
#define ETH_MACVLTRR_VTHM                      (0x01U << ETH_MACVLTRR_VTHM_Pos)    ///< VLAN TAG Hash Mode
#define ETH_MACVLTRR_VTIM_Pos                  (17)
#define ETH_MACVLTRR_VTIM                      (0x01U << ETH_MACVLTRR_VTIM_Pos)    ///< VLAN TAG Inverse Mode
#define ETH_MACVLTRR_VTSEL_Pos                 (16)
#define ETH_MACVLTRR_VTSEL                     (0x01U << ETH_MACVLTRR_VTSEL_Pos)   ///< VLAN TAG Filter Tag Value
#define ETH_MACVLTRR_VLFLT_Pos                 (0)
#define ETH_MACVLTRR_VLFLT                     (0xFFFFU << ETH_MACVLTRR_VLFLT_Pos) ///< VLAN TAG Filter Tag Valu

//legacy define
#define ETH_MACVLANTR_VLANTI_Pos               ETH_MACVLTRR_VLFLT_Pos
#define ETH_MACVLANTR_VLANTI                   ETH_MACVLTRR_VLFLT

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PMTRWFR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PMTRWFR_RTWKFLT                    (0xFFFFFFFFU) ///< Remote-Wakeup Filter Value
//legacy define
#define ETH_MACRWUFFR_D                        ETH_PMTRWFR_RTWKFLT

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PMTCR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PMTCR_RTWKFR_Pos                   (31)
#define ETH_PMTCR_RTWKFR                       (0x01U << ETH_PMTCR_RTWKFR_Pos) ///< Remote-Wakeup Filter Value
#define ETH_PMTCR_RTWKPT_Pos                   (24)
#define ETH_PMTCR_RTWKPT                       (0x07U << ETH_PMTCR_RTWKPT_Pos) ///< Remote-Wakeup Filter Point
#define ETH_PMTCR_RTWKTR_Pos                   (10)
#define ETH_PMTCR_RTWKTR                       (0x01U << ETH_PMTCR_RTWKTR_Pos) ///< Remote-Wakeup Frame Transfer & Receive Enable
#define ETH_PMTCR_GLUB_Pos                     (9)
#define ETH_PMTCR_GLUB                         (0x01U << ETH_PMTCR_GLUB_Pos)   ///< Global Unicast
#define ETH_PMTCR_WKFR_Pos                     (6)
#define ETH_PMTCR_WKFR                         (0x01U << ETH_PMTCR_WKFR_Pos)   ///< Remote-Wakeup Frame Receive Status
#define ETH_PMTCR_MPFR_Pos                     (5)
#define ETH_PMTCR_MPFR                         (0x01U << ETH_PMTCR_MPFR_Pos)   ///< Magic-Packet Frame Receive Status
#define ETH_PMTCR_WKEN_Pos                     (2)
#define ETH_PMTCR_WKEN                         (0x01U << ETH_PMTCR_WKEN_Pos)   ///< Magic-Packet Frame Receive Enable
#define ETH_PMTCR_MPEN_Pos                     (1)
#define ETH_PMTCR_MPEN                         (0x01U << ETH_PMTCR_MPEN_Pos)   ///< Magic-Packet Frame Receive Status
#define ETH_PMTCR_PWDN_Pos                     (0)
#define ETH_PMTCR_PWDN                         (0x01U << ETH_PMTCR_PWDN_Pos)   ///< Power Down Mode

//legacy define
#define ETH_MACPMTCSR_WFFRPR_Pos               ETH_PMTCR_RTWKFR_Pos
#define ETH_MACPMTCSR_WFFRPR                   ETH_PMTCR_RTWKFR
#define ETH_MACPMTCSR_GU_Pos                   ETH_PMTCR_GLUB_Pos
#define ETH_MACPMTCSR_GU                       ETH_PMTCR_GLUB
#define ETH_MACPMTCSR_WFR_Pos                  ETH_PMTCR_WKFR_Pos
#define ETH_MACPMTCSR_WFR                      ETH_PMTCR_WKFR
#define ETH_MACPMTCSR_MPR_Pos                  ETH_PMTCR_MPFR_Pos
#define ETH_MACPMTCSR_MPR                      ETH_PMTCR_MPFR
#define ETH_MACPMTCSR_WFE_Pos                  ETH_PMTCR_WKEN_Pos
#define ETH_MACPMTCSR_WFE                      ETH_PMTCR_WKEN
#define ETH_MACPMTCSR_MPE_Pos                  ETH_PMTCR_MPEN_Pos
#define ETH_MACPMTCSR_MPE                      ETH_PMTCR_MPEN
#define ETH_MACPMTCSR_PD_Pos                   ETH_PMTCR_PWDN_Pos
#define ETH_MACPMTCSR_PD                       ETH_PMTCR_PWDN

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACSR_TXFF_Pos                     (25)
#define ETH_MACSR_TXFF                         (0x01U << ETH_MACSR_TXFF_Pos)  ///< TxFIFO Full
#define ETH_MACSR_TXFNE_Pos                    (24)
#define ETH_MACSR_TXFNE                        (0x01U << ETH_MACSR_TXFNE_Pos) ///< Global Unicast
#define ETH_MACSR_TXFWA_Pos                    (22)
#define ETH_MACSR_TXFWA                        (0x01U << ETH_MACSR_TXFWA_Pos) ///< TxFIFO Write Active
#define ETH_MACSR_TXFRS_Pos                    (20)
#define ETH_MACSR_TXFRS                        (0x03U << ETH_MACSR_TXFRS_Pos) ///< TxFIFO Read Status
#define ETH_MACSR_TXFRS_0                      (0x00U << ETH_MACSR_TXFRS_Pos) ///< Idle state
#define ETH_MACSR_TXFRS_1                      (0x01U << ETH_MACSR_TXFRS_Pos) ///< Read state
#define ETH_MACSR_TXFRS_2                      (0x02U << ETH_MACSR_TXFRS_Pos) ///< Waiting for Tx status from MAC transmitter
#define ETH_MACSR_TXFRS_3                      (0x03U << ETH_MACSR_TXFRS_Pos) ///< Writing the received Tx status or flushing the TxFIFO

#define ETH_MACSR_MTP_Pos                      (19)
#define ETH_MACSR_MTP                          (0x01U << ETH_MACSR_MTP_Pos)   ///< MAC Transmitter in Pause
#define ETH_MACSR_MTS_Pos                      (17)
#define ETH_MACSR_MTS                          (0x03U << ETH_MACSR_MTS_Pos)   ///< MAC Transfer Status
#define ETH_MACSR_MTS_0                        (0x00U << ETH_MACSR_MTS_Pos)   ///< Idle state
#define ETH_MACSR_MTS_1                        (0x01U << ETH_MACSR_MTS_Pos)   ///< Waiting for status of previous frame or IFG backoff period to be over
#define ETH_MACSR_MTS_2                        (0x02U << ETH_MACSR_MTS_Pos)   ///< Generating and transmitting a pause control frame (in full duplex mode)
#define ETH_MACSR_MTS_3                        (0x03U << ETH_MACSR_MTS_Pos)   ///< Transferring input frame for transmission
#define ETH_MACSR_MTE_Pos                      (16)
#define ETH_MACSR_MTE                          (0x01U << ETH_MACSR_MTE_Pos)   ///< MAC MII Transfer Engine Status

