wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_enet.h
#define ETH_MACSR_RXFL_Pos                     (8)
#define ETH_MACSR_RXFL                         (0x01U << ETH_MACSR_RXFL_Pos)  ///< RxFIFO Fill Level
#define ETH_MACSR_RXFL_0                       (0x00U << ETH_MACSR_RXFL_Pos)  ///< RxFIFO empty
#define ETH_MACSR_RXFL_1                       (0x01U << ETH_MACSR_RXFL_Pos)  ///< RxFIFO fill-level below flow-control, de-activate threshold
#define ETH_MACSR_RXFL_2                       (0x02U << ETH_MACSR_RXFL_Pos)  ///< RxFIFO fill-level above flow-control, activate threshold
#define ETH_MACSR_RXFL_3                       (0x03U << ETH_MACSR_RXFL_Pos)  ///< RxFIFO full

#define ETH_MACSR_RXFRS_Pos                    (5)
#define ETH_MACSR_RXFRS                        (0x03U << ETH_MACSR_RXFRS_Pos) ///< RxFIFO Read Status
#define ETH_MACSR_RXFRS_0                      (0x00U << ETH_MACSR_RXFRS_Pos) ///< Idle state
#define ETH_MACSR_RXFRS_1                      (0x01U << ETH_MACSR_RXFRS_Pos) ///< Reading frame data
#define ETH_MACSR_RXFRS_2                      (0x02U << ETH_MACSR_RXFRS_Pos) ///< Reading frame status or time-stamp
#define ETH_MACSR_RXFRS_3                      (0x03U << ETH_MACSR_RXFRS_Pos) ///< Flushing the frame data and status

#define ETH_MACSR_RXFWA_Pos                    (4)
#define ETH_MACSR_RXFWA                        (0x01U << ETH_MACSR_RXFWA_Pos) ///< RxFIFO Write Active

#define ETH_MACSR_MRS_Pos                      (1)
#define ETH_MACSR_MRS                          (0x03U << ETH_MACSR_MRS_Pos)   ///< MAC Receive Status
#define ETH_MACSR_MRS_0                        (0x00U << ETH_MACSR_MRS_Pos)   ///< Idle
#define ETH_MACSR_MRS_1                        (0x01U << ETH_MACSR_MRS_Pos)   ///< FIFO write controller in the MAC receiver is operating
#define ETH_MACSR_MRS_2                        (0x02U << ETH_MACSR_MRS_Pos)   ///< FIFO read controller in the MAC receiver is operating
#define ETH_MACSR_MRS_3                        (0x03U << ETH_MACSR_MRS_Pos)   ///< FIFO read and write controllers in the MAC receiver are operating
#define ETH_MACSR_MRE_Pos                      (0)
#define ETH_MACSR_MRE                          (0x01U << ETH_MACSR_MRE_Pos)   ///< MAC MII Receive Engine Status

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACISR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACISR_PTPIS_Pos                   (9)
#define ETH_MACISR_PTPIS                       (0x01U << ETH_MACISR_PTPIS_Pos)   ///< PTP Interrupt Status
#define ETH_MACISR_MMCTXIS_Pos                 (6)
#define ETH_MACISR_MMCTXIS                     (0x01U << ETH_MACISR_MMCTXIS_Pos) ///< MMC Transfer Interrupt Status
#define ETH_MACISR_MMCRXIS_Pos                 (5)
#define ETH_MACISR_MMCRXIS                     (0x01U << ETH_MACISR_MMCRXIS_Pos) ///< MMC Transfer Interrupt Status
#define ETH_MACISR_MMCIS_Pos                   (4)
#define ETH_MACISR_MMCIS                       (0x01U << ETH_MACISR_MMCIS_Pos)   ///< MMC Interrupt Status
#define ETH_MACISR_PMTIS_Pos                   (3)
#define ETH_MACISR_PMTIS                       (0x01U << ETH_MACISR_PMTIS_Pos)   ///< PMT Interrupt Status

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACIMR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACIMR_PTPIM_Pos                   (9)
#define ETH_MACIMR_PTPIM                       (0x01U << ETH_MACIMR_PTPIM_Pos) ///< PTP Interrupt Mask
#define ETH_MACIMR_PMTIM_Pos                   (3)
#define ETH_MACIMR_PMTIM                       (0x01U << ETH_MACIMR_PMTIM_Pos) ///< PMT Interrupt Mask

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA0HR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA0HR_MACADDH                    ((uint32_t)0x0000FFFF) ///< MAC Address Filter Address Value High
//legacy define
#define ETH_MACA0HR_MACA0H                     ETH_MACA0HR_MACADDH

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA0LR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA0LR_MACADDL                    ((uint32_t)0xFFFFFFFF) ///< MAC Address Filter Address Value Low
//legacy define
#define ETH_MACA0LR_MACA0L                     ETH_MACA0LR_MACADDL

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA1HR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA1HR_ADDE_Pos                   (31)
#define ETH_MACA1HR_ADDE                       (0x01U << ETH_MACA1HR_ADDE_Pos)      ///< Address Filter Enable
#define ETH_MACA1HR_SELE_Pos                   (30)
#define ETH_MACA1HR_SELE                       (0x01U << ETH_MACA1HR_SELE_Pos)      ///< SA/DA Filter Select Enable
#define ETH_MACA1HR_MBYTEC_Pos                 (24)
#define ETH_MACA1HR_MBYTEC                     (0x3FU << ETH_MACA1HR_MBYTEC_Pos)    ///< Mask Byte Control
#define ETH_MACA1HR_MBYTEC_29_BIT              (0x20U << ETH_MACA1HR_MBYTEC_Pos)    ///< Mask MACADDH[15:8] bits
#define ETH_MACA1HR_MBYTEC_28_BIT              (0x10U << ETH_MACA1HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA1HR_MBYTEC_27_BIT              (0x08U << ETH_MACA1HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA1HR_MBYTEC_26_BIT              (0x04U << ETH_MACA1HR_MBYTEC_Pos)    ///< Mask MACADDL[23:16] bits
#define ETH_MACA1HR_MBYTEC_25_BIT              (0x02U << ETH_MACA1HR_MBYTEC_Pos)    ///< Mask MACADDL[15:8] bits
#define ETH_MACA1HR_MBYTEC_24_BIT              (0x01U << ETH_MACA1HR_MBYTEC_Pos)    ///< Mask MACADDL[7:0] bits
#define ETH_MACA1HR_MACADDH_Pos                (0)
#define ETH_MACA1HR_MACADDH                    (0xFFFFU << ETH_MACA1HR_MACADDH_Pos) ///< MAC Address Filter Address Value High

//legacy define
#define ETH_MACA1HR_AE_Pos                     ETH_MACA1HR_ADDE_Pos
#define ETH_MACA1HR_AE                         ETH_MACA1HR_ADDE
#define ETH_MACA1HR_SA_Pos                     ETH_MACA1HR_SELE_Pos
#define ETH_MACA1HR_SA                         ETH_MACA1HR_SELE
#define ETH_MACA1HR_MBC_Pos                    ETH_MACA1HR_MBYTEC_Pos
#define ETH_MACA1HR_MBC                        ETH_MACA1HR_MBYTEC
#define ETH_MACA1HR_MBC_HBits15_8              ETH_MACA1HR_MBYTEC_29_BIT
#define ETH_MACA1HR_MBC_HBits7_0               ETH_MACA1HR_MBYTEC_28_BIT
#define ETH_MACA1HR_MBC_LBits31_24             ETH_MACA1HR_MBYTEC_27_BIT
#define ETH_MACA1HR_MBC_LBits23_16             ETH_MACA1HR_MBYTEC_26_BIT
#define ETH_MACA1HR_MBC_LBits15_8              ETH_MACA1HR_MBYTEC_25_BIT
#define ETH_MACA1HR_MBC_LBits7_0               ETH_MACA1HR_MBYTEC_24_BIT
#define ETH_MACA1HR_MACA1H_Pos                 ETH_MACA1HR_MACADDH_Pos
#define ETH_MACA1HR_MACA1H                     ETH_MACA1HR_MACADDH

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA1LR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA1LR_MACADDL                    ((uint32_t)0xFFFFFFFF) ///< MAC Address Filter Address Value Low
//legacy define
#define ETH_MACA1LR_MACA1L                     ETH_MACA1LR_MACADDL

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA2HR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA2HR_ADDE_Pos                   (31)
#define ETH_MACA2HR_ADDE                       (0x01U << ETH_MACA2HR_ADDE_Pos)      ///< Address Filter Enable
#define ETH_MACA2HR_SELE_Pos                   (30)
#define ETH_MACA2HR_SELE                       (0x01U << ETH_MACA2HR_SELE_Pos)      ///< SA/DA Filter Select Enable
#define ETH_MACA2HR_MBYTEC_Pos                 (24)
#define ETH_MACA2HR_MBYTEC                     (0x3FU << ETH_MACA2HR_MBYTEC_Pos)    ///< Mask Byte Control
#define ETH_MACA2HR_MBYTEC_29_BIT              (0x20U << ETH_MACA2HR_MBYTEC_Pos)    ///< Mask MACADDH[15:8] bits
#define ETH_MACA2HR_MBYTEC_28_BIT              (0x10U << ETH_MACA2HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA2HR_MBYTEC_27_BIT              (0x08U << ETH_MACA2HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA2HR_MBYTEC_26_BIT              (0x04U << ETH_MACA2HR_MBYTEC_Pos)    ///< Mask MACADDL[23:16] bits
#define ETH_MACA2HR_MBYTEC_25_BIT              (0x02U << ETH_MACA2HR_MBYTEC_Pos)    ///< Mask MACADDL[15:8] bits
#define ETH_MACA2HR_MBYTEC_24_BIT              (0x01U << ETH_MACA2HR_MBYTEC_Pos)    ///< Mask MACADDL[7:0] bits
#define ETH_MACA2HR_MACADDH_Pos                (0)
#define ETH_MACA2HR_MACADDH                    (0xFFFFU << ETH_MACA2HR_MACADDH_Pos) ///< MAC Address Filter Address Value High

//legacy define
#define ETH_MACA2HR_AE_Pos                     ETH_MACA2HR_ADDE_Pos
#define ETH_MACA2HR_AE                         ETH_MACA2HR_ADDE
#define ETH_MACA2HR_SA_Pos                     ETH_MACA2HR_SELE_Pos
#define ETH_MACA2HR_SA                         ETH_MACA2HR_SELE
#define ETH_MACA2HR_MBC_Pos                    ETH_MACA2HR_MBYTEC_Pos
#define ETH_MACA2HR_MBC                        ETH_MACA2HR_MBYTEC
#define ETH_MACA2HR_MBC_HBits15_8              ETH_MACA2HR_MBYTEC_29_BIT
#define ETH_MACA2HR_MBC_HBits7_0               ETH_MACA2HR_MBYTEC_28_BIT
#define ETH_MACA2HR_MBC_LBits31_24             ETH_MACA2HR_MBYTEC_27_BIT
#define ETH_MACA2HR_MBC_LBits23_16             ETH_MACA2HR_MBYTEC_26_BIT
#define ETH_MACA2HR_MBC_LBits15_8              ETH_MACA2HR_MBYTEC_25_BIT
#define ETH_MACA2HR_MBC_LBits7_0               ETH_MACA2HR_MBYTEC_24_BIT
#define ETH_MACA2HR_MACA2H_Pos                 ETH_MACA2HR_MACADDH_Pos
#define ETH_MACA2HR_MACA2H                     ETH_MACA2HR_MACADDH

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA2LR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA2LR_MACADDL                    ((uint32_t)0xFFFFFFFF) ///< MAC Address Filter Address Value Low
//legacy define
#define ETH_MACA2LR_MACA2L                     ETH_MACA2LR_MACADDL

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA3HR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA3HR_ADDE_Pos                   (31)
#define ETH_MACA3HR_ADDE                       (0x01U << ETH_MACA3HR_ADDE_Pos)      ///< Address Filter Enable
#define ETH_MACA3HR_SELE_Pos                   (30)
#define ETH_MACA3HR_SELE                       (0x01U << ETH_MACA3HR_SELE_Pos)      ///< SA/DA Filter Select Enable
#define ETH_MACA3HR_MBYTEC_Pos                 (24)
#define ETH_MACA3HR_MBYTEC                     (0x3FU << ETH_MACA3HR_MBYTEC_Pos)    ///< Mask Byte Control
#define ETH_MACA3HR_MBYTEC_29_BIT              (0x20U << ETH_MACA3HR_MBYTEC_Pos)    ///< Mask MACADDH[15:8] bits
#define ETH_MACA3HR_MBYTEC_28_BIT              (0x10U << ETH_MACA3HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA3HR_MBYTEC_27_BIT              (0x08U << ETH_MACA3HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA3HR_MBYTEC_26_BIT              (0x04U << ETH_MACA3HR_MBYTEC_Pos)    ///< Mask MACADDL[23:16] bits
#define ETH_MACA3HR_MBYTEC_25_BIT              (0x02U << ETH_MACA3HR_MBYTEC_Pos)    ///< Mask MACADDL[15:8] bits
#define ETH_MACA3HR_MBYTEC_24_BIT              (0x01U << ETH_MACA3HR_MBYTEC_Pos)    ///< Mask MACADDL[7:0] bits
#define ETH_MACA3HR_MACADDH_Pos                (0)
#define ETH_MACA3HR_MACADDH                    (0xFFFFU << ETH_MACA3HR_MACADDH_Pos) ///< MAC Address Filter Address Value High

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA3LR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA3LR_MACADDL                    ((uint32_t)0xFFFFFFFF) ///< MAC Address Filter Address Value Low

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA4HR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA4HR_ADDE_Pos                   (31)
#define ETH_MACA4HR_ADDE                       (0x01U << ETH_MACA4HR_ADDE_Pos)      ///< Address Filter Enable
#define ETH_MACA4HR_SELE_Pos                   (30)
#define ETH_MACA4HR_SELE                       (0x01U << ETH_MACA4HR_SELE_Pos)      ///< SA/DA Filter Select Enable
#define ETH_MACA4HR_MBYTEC_Pos                 (24)
#define ETH_MACA4HR_MBYTEC                     (0x3FU << ETH_MACA4HR_MBYTEC_Pos)    ///< Mask Byte Control
#define ETH_MACA4HR_MBYTEC_29_BIT              (0x20U << ETH_MACA4HR_MBYTEC_Pos)    ///< Mask MACADDH[15:8] bits
#define ETH_MACA4HR_MBYTEC_28_BIT              (0x10U << ETH_MACA4HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA4HR_MBYTEC_27_BIT              (0x08U << ETH_MACA4HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA4HR_MBYTEC_26_BIT              (0x04U << ETH_MACA4HR_MBYTEC_Pos)    ///< Mask MACADDL[23:16] bits
#define ETH_MACA4HR_MBYTEC_25_BIT              (0x02U << ETH_MACA4HR_MBYTEC_Pos)    ///< Mask MACADDL[15:8] bits
#define ETH_MACA4HR_MBYTEC_24_BIT              (0x01U << ETH_MACA4HR_MBYTEC_Pos)    ///< Mask MACADDL[7:0] bits
#define ETH_MACA4HR_MACADDH_Pos                (0)
#define ETH_MACA4HR_MACADDH                    (0xFFFFU << ETH_MACA4HR_MACADDH_Pos) ///< MAC Address Filter Address Value High

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA4LR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA4LR_MACADDL                    ((uint32_t)0xFFFFFFFF) ///< MAC Address Filter Address Value Low

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA5HR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA5HR_ADDE_Pos                   (31)
#define ETH_MACA5HR_ADDE                       (0x01U << ETH_MACA5HR_ADDE_Pos)      ///< Address Filter Enable
#define ETH_MACA5HR_SELE_Pos                   (30)
#define ETH_MACA5HR_SELE                       (0x01U << ETH_MACA5HR_SELE_Pos)      ///< SA/DA Filter Select Enable
#define ETH_MACA5HR_MBYTEC_Pos                 (24)
#define ETH_MACA5HR_MBYTEC                     (0x3FU << ETH_MACA5HR_MBYTEC_Pos)    ///< Mask Byte Control
#define ETH_MACA5HR_MBYTEC_29_BIT              (0x20U << ETH_MACA5HR_MBYTEC_Pos)    ///< Mask MACADDH[15:8] bits
#define ETH_MACA5HR_MBYTEC_28_BIT              (0x10U << ETH_MACA5HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA5HR_MBYTEC_27_BIT              (0x08U << ETH_MACA5HR_MBYTEC_Pos)    ///< Mask MACADDH[7:0] bits
#define ETH_MACA5HR_MBYTEC_26_BIT              (0x04U << ETH_MACA5HR_MBYTEC_Pos)    ///< Mask MACADDL[23:16] bits
#define ETH_MACA5HR_MBYTEC_25_BIT              (0x02U << ETH_MACA5HR_MBYTEC_Pos)    ///< Mask MACADDL[15:8] bits
#define ETH_MACA5HR_MBYTEC_24_BIT              (0x01U << ETH_MACA5HR_MBYTEC_Pos)    ///< Mask MACADDL[7:0] bits
#define ETH_MACA5HR_MACADDH_Pos                (0)
#define ETH_MACA5HR_MACADDH                    (0xFFFFU << ETH_MACA5HR_MACADDH_Pos) ///< MAC Address Filter Address Value High
////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MACA5LR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACA5LR_MACADDL                    ((uint32_t)0xFFFFFFFF) ///< MAC Address Filter Address Value Low

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_ENET_MACVLTTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACVLTTR_VLANS_Pos                 (18)
#define ETH_MACVLTTR_VLANS                     (0x01U << ETH_MACVLTTR_VLANS_Pos)   ///< VLAN Select
#define ETH_MACVLTTR_VLANC_Pos                 (16)
#define ETH_MACVLTTR_VLANC                     (0x01U << ETH_MACVLTTR_VLANC_Pos)   ///< VLAN Control
#define ETH_MACVLTTR_VLANC_0                   (0x00U << ETH_MACVLTTR_VLANC_Pos)   ///< Send directly without other actions
#define ETH_MACVLTTR_VLANC_1                   (0x01U << ETH_MACVLTTR_VLANC_Pos)   ///< Remove the TYPE field and the tag field from the VLAN frame
#define ETH_MACVLTTR_VLANC_2                   (0x02U << ETH_MACVLTTR_VLANC_Pos)   ///< Insert the value of the VLANV bit of this register as a tag field
#define ETH_MACVLTTR_VLANC_3                   (0x03U << ETH_MACVLTTR_VLANC_Pos)   ///< Replace the tag field in the original frame
#define ETH_MACVLTTR_VLANV_Pos                 (0)
#define ETH_MACVLTTR_VLANV                     (0xFFFFU << ETH_MACVLTTR_VLANV_Pos) ///< VLAN Value

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_ENET_MACVLHTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MACVLHTR_VLHTAB_Pos                (0)
#define ETH_MACVLHTR_VLHTAB                    (0xFFFFU << ETH_MACVLHTR_VLHTAB_Pos) ///< VLAN Hash Table Value

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCCR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCCR_MCFHP                        ((uint32_t)0x00000020)       ///< MMC counter Full-Half preset
#define ETH_MMCCR_MCP                          ((uint32_t)0x00000010)       ///< MMC counter preset
#define ETH_MMCCR_MCF                          ((uint32_t)0x00000008)       ///< MMC Counter Freeze
#define ETH_MMCCR_ROR_Pos                      (2)
#define ETH_MMCCR_ROR                          (0x01U << ETH_MMCCR_ROR_Pos) ///< Reset on Read
#define ETH_MMCCR_CSR_Pos                      (1)
#define ETH_MMCCR_CSR                          (0x01U << ETH_MMCCR_CSR_Pos) ///< Counter Stop Rollover
#define ETH_MMCCR_CR_Pos                       (0)
#define ETH_MMCCR_CR                           (0x01U << ETH_MMCCR_CR_Pos)  ///< Counters Reset

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCRIR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCRIR_RGUF_Pos                    (17)
#define ETH_MMCRIR_RGUFS                       (0x01U << ETH_MMCRIR_RGUF_Pos)  ///< Set when Rx good unicast frames counter reaches half the maximum value
#define ETH_MMCRIR_RFAES_Pos                   (6)
#define ETH_MMCRIR_RFAES                       (0x01U << ETH_MMCRIR_RFAES_Pos) ///< Set when Rx alignment error counter reaches half the maximum value
#define ETH_MMCRIR_RFCES_Pos                   (5)
#define ETH_MMCRIR_RFCES                       (0x01U << ETH_MMCRIR_RFCES_Pos) ///< Set when Rx crc error counter reaches half the maximum value

//legacy define
#define ETH_MMCRIMR_RGUFM_Pos                  ETH_MMCRIR_RGUF_Pos
#define ETH_MMCRIMR_RGUFM                      ETH_MMCRIR_RGUFS
#define ETH_MMCRIMR_RFAEM_Pos                  ETH_MMCRIR_RFAES_Pos
#define ETH_MMCRIMR_RFAEM                      ETH_MMCRIR_RFAES
#define ETH_MMCRIMR_RFCEM_Pos                  ETH_MMCRIR_RFCES_Pos
#define ETH_MMCRIMR_RFCEM                      ETH_MMCRIR_RFCES

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCTIR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCTIR_TGFS_Pos                    (21)
#define ETH_MMCTIR_TGFS                        (0x01U << ETH_MMCTIR_TGFS_Pos)    ///< Set when Tx good frame count counter reaches half the maximum value
#define ETH_MMCTIR_TGFMSCS_Pos                 (15)
#define ETH_MMCTIR_TGFMSCS                     (0x01U << ETH_MMCTIR_TGFMSCS_Pos) ///< Set when Tx good multi col counter reaches half the maximum value
#define ETH_MMCTIR_TGFSCS_Pos                  (14)
#define ETH_MMCTIR_TGFSCS                      (0x01U << ETH_MMCTIR_TGFSCS_Pos)  ///< Set when Tx good single col counter reaches half the maximum value

//legacy define
#define ETH_MMCTIMR_TGFM_Pos                   ETH_MMCTIR_TGFS_Pos
#define ETH_MMCTIMR_TGFM                       ETH_MMCTIR_TGFS
#define ETH_MMCTIMR_TGFMSCM_Pos                ETH_MMCTIR_TGFMSCS_Pos
#define ETH_MMCTIMR_TGFMSCM                    ETH_MMCTIR_TGFMSCS
#define ETH_MMCTIMR_TGFSCM_Pos                 ETH_MMCTIR_TGFSCS_Pos
#define ETH_MMCTIMR_TGFSCM                     ETH_MMCTIR_TGFSCS

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCTGSCR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCTGSCR_TGSC                      (0xFFFFFFFFU) ///< Transfer Good Frame after Single-Collision
//legacy define
#define ETH_MMCTGFSCCR_TGFSCC                  ETH_MMCTGSCR_TGSC

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCTGMCR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCTGMCR_TGMC                      (0xFFFFFFFFU) ///< Transfer Good Frame after Multi-Collision
//legacy define
#define ETH_MMCTGFMSCCR_TGFMSCC                ETH_MMCTGMCR_TGMC

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCTGR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCTGR_MMCTG                       (0xFFFFFFFFU) ///< MMC Transfer Good Frame
//legacy define
#define ETH_MMCTGFCR_TGFC                      ETH_MMCTGR_MMCTG

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCRCRCER Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCRCRCER_RCRCE                    (0xFFFFFFFFU) ///< MMC Receive CRC Error Frame
//legacy define
#define ETH_MMCRFCECR_RFCEC                    ETH_MMCRCRCER_RCRCE

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCRALIER Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCRALIER_RALIE                    (0xFFFFFFFFU) ///< MMC Receive Align Error Frame
//legacy define
#define ETH_MMCRFAECR_RFAEC                    ETH_MMCRALIER_RALIE

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCRUGR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCRUGR_MMCRUG                     (0xFFFFFFFFU << ETH_MMCRUGR_MMCRUG_Pos) ///< MMC Receive Unicast Good Frame
//legacy define
#define ETH_MMCRGUFCR_RGUFC                    ETH_MMCRUGR_MMCRUG

