wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_enet.h
////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMABSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMABSR_TXPR_Pos                    (27)
#define ETH_DMABSR_TXPR                        (0x01U << ETH_DMABSR_TXPR_Pos) ///< Transfer Priority
#define ETH_DMABSR_MBST_Pos                    (26)
#define ETH_DMABSR_MBST                        (0x01U << ETH_DMABSR_MBST_Pos) ///< Mixed Burst
#define ETH_DMABSR_AAL_Pos                     (25)
#define ETH_DMABSR_AAL                         (0x01U << ETH_DMABSR_AAL_Pos)  ///< Address Align
#define ETH_DMABSR_MPBL_Pos                    (24)
#define ETH_DMABSR_MPBL                        (0x01U << ETH_DMABSR_MPBL_Pos) ///< Multiple PBL Mode
#define ETH_DMABSR_SPBL_Pos                    (23)
#define ETH_DMABSR_SPBL                        (0x01U << ETH_DMABSR_SPBL_Pos) ///< Separate PBL Mode
#define ETH_DMABSR_RPBL_Pos                    (17)
#define ETH_DMABSR_RPBL                        (0x3FU << ETH_DMABSR_RPBL_Pos) ///< Receive Programmable Burst Length
#define ETH_DMABSR_FBST_Pos                    (16)
#define ETH_DMABSR_FBST                        (0x01U << ETH_DMABSR_FBST_Pos) ///< Fixed Burst

#define ETH_DMABSR_FTPR_Pos                    (14)
#define ETH_DMABSR_FTPR                        (0x03U << ETH_DMABSR_FTPR_Pos) ///< Fixed Transfer Priority Ratio
#define ETH_DMABSR_FTPR_1_1                    (0x00U << ETH_DMABSR_FTPR_Pos) ///< 1:1
#define ETH_DMABSR_FTPR_2_1                    (0x01U << ETH_DMABSR_FTPR_Pos) ///< 2:1
#define ETH_DMABSR_FTPR_3_1                    (0x02U << ETH_DMABSR_FTPR_Pos) ///< 3:1
#define ETH_DMABSR_FTPR_4_1                    (0x03U << ETH_DMABSR_FTPR_Pos) ///< 4:1

#define ETH_DMABSR_TPBL_Pos                    (8)
#define ETH_DMABSR_TPBL                        (0x3FU << ETH_DMABSR_TPBL_Pos) ///< Transfer Programmable Burst Length
#define ETH_DMABSR_TPBL_1Beat                  (0x01U << ETH_DMABSR_TPBL_Pos) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 1
#define ETH_DMABSR_TPBL_2Beat                  (0x02U << ETH_DMABSR_TPBL_Pos) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 2
#define ETH_DMABSR_TPBL_4Beat                  (0x04U << ETH_DMABSR_TPBL_Pos) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 4
#define ETH_DMABSR_TPBL_8Beat                  (0x08U << ETH_DMABSR_TPBL_Pos) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 8
#define ETH_DMABSR_TPBL_16Beat                 (0x10U << ETH_DMABSR_TPBL_Pos) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 16
#define ETH_DMABSR_TPBL_32Beat                 (0x20U << ETH_DMABSR_TPBL_Pos) ///< maximum number of beats to be transferred in one TxDMA (or both) transaction is 32
#define ETH_DMABSR_DSEN_Pos                    (7)
#define ETH_DMABSR_DSEN                        (0x01U << ETH_DMABSR_DSEN_Pos) ///< Advanced Descriptor Enable
#define ETH_DMABSR_DSL_Pos                     (2)
#define ETH_DMABSR_DSL                         (0x1FU << ETH_DMABSR_DSL_Pos)  ///< Descriptor Skip Length
#define ETH_DMABSR_DMAA_Pos                    (1)
#define ETH_DMABSR_DMAA                        (0x01U << ETH_DMABSR_DMAA_Pos) ///< DMA Arbiter
#define ETH_DMABSR_SR_Pos                      (0)
#define ETH_DMABSR_SR                          (0x01U << ETH_DMABSR_SR_Pos)   ///< Software Reset

//legacy define
#define ETH_DMABMR_FB_Pos                      ETH_DMABSR_FBST_Pos
#define ETH_DMABMR_FB                          ETH_DMABSR_FBST
#define ETH_DMABMR_RTPR_Pos                    ETH_DMABSR_FTPR_Pos
#define ETH_DMABMR_RTPR                        ETH_DMABSR_FTPR
#define ETH_DMABMR_RTPR_1_1                    ETH_DMABSR_FTPR_1_1
#define ETH_DMABMR_RTPR_2_1                    ETH_DMABSR_FTPR_2_1
#define ETH_DMABMR_RTPR_3_1                    ETH_DMABSR_FTPR_3_1
#define ETH_DMABMR_RTPR_4_1                    ETH_DMABSR_FTPR_4_1
#define ETH_DMABMR_PBL_Pos                     ETH_DMABSR_TPBL_Pos
#define ETH_DMABMR_PBL                         ETH_DMABSR_TPBL
#define ETH_DMABMR_PBL_1Beat                   ETH_DMABSR_TPBL_1Beat
#define ETH_DMABMR_PBL_2Beat                   ETH_DMABSR_TPBL_2Beat
#define ETH_DMABMR_PBL_4Beat                   ETH_DMABSR_TPBL_4Beat
#define ETH_DMABMR_PBL_8Beat                   ETH_DMABSR_TPBL_8Beat
#define ETH_DMABMR_PBL_16Beat                  ETH_DMABSR_TPBL_16Beat
#define ETH_DMABMR_PBL_32Beat                  ETH_DMABSR_TPBL_32Beat
#define ETH_DMABMR_DSL_Pos                     ETH_DMABSR_DSL_Pos
#define ETH_DMABMR_DSL                         ETH_DMABSR_DSL
#define ETH_DMABMR_DA_Pos                      ETH_DMABSR_DMAA_Pos
#define ETH_DMABMR_DA                          ETH_DMABSR_DMAA
#define ETH_DMABMR_SR_Pos                      ETH_DMABSR_SR_Pos
#define ETH_DMABMR_SR                          ETH_DMABSR_SR

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMATXPDR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMATXPDR_TXPD                      (0xFFFFFFFFU) ///< Transmit poll demand
//legacy define
#define ETH_DMATPDR_TPD                        ETH_DMATXPDR_TXPD

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMARXPDR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMARXPDR_RXPD                      (0xFFFFFFFFU) ///< Receive poll demand
//legacy define
#define ETH_DMARPDR_RPD                        ETH_DMARXPDR_RXPD

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMARXDSAR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMARXDSAR_RXDSA                    (0xFFFFFFFFU) ///< Receive Descriptor Address
//legacy define
#define ETH_DMARDLAR_SRL                       ETH_DMARXDSAR_RXDSA

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMATXDSAR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMATXDSAR_TXDSA                    (0xFFFFFFFFU) ///< Start of transmit list
//legacy define
#define ETH_DMATDLAR_STL                       ETH_DMATXDSAR_TXDSA

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMASR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMASR_PTPS_Pos                     (29)
#define ETH_DMASR_PTPS                         (0x01U << ETH_DMASR_PTPS_Pos) ///< PTP status
#define ETH_DMASR_PMTS_Pos                     (28)
#define ETH_DMASR_PMTS                         (0x01U << ETH_DMASR_PMTS_Pos) ///< PMT status
#define ETH_DMASR_MMCS_Pos                     (27)
#define ETH_DMASR_MMCS                         (0x01U << ETH_DMASR_MMCS_Pos) ///< MMC status
#define ETH_DMASR_LIS_Pos                      (26)
#define ETH_DMASR_LIS                          (0x01U << ETH_DMASR_LIS_Pos)  ///< GMAC Line interface Status
//???thy bit 26 is Reserved in UM
#define ETH_DMASR_EBS_Pos                      (23)
#define ETH_DMASR_EBS                          (0x07U << ETH_DMASR_EBS_Pos)  ///< Error bits status
#define ETH_DMASR_EBS_DescAccess               (0x04U << ETH_DMASR_EBS_Pos)  ///< Error bits 0-data buffer, 1-desc. access
#define ETH_DMASR_EBS_ReadTransf               (0x02U << ETH_DMASR_EBS_Pos)  ///< Error bits 0-write trnsf, 1-read transfr
#define ETH_DMASR_EBS_DataTransfTx             (0x01U << ETH_DMASR_EBS_Pos)  ///< Error bits 0-Rx DMA, 1-Tx DMA
#define ETH_DMASR_TPS_Pos                      (20)
#define ETH_DMASR_TPS                          (0x007U << ETH_DMASR_TPS_Pos) ///< Transmit process state
#define ETH_DMASR_TPS_Stopped                  (0x000U << ETH_DMASR_TPS_Pos) ///< Stopped - Reset or Stop Tx Command issued
#define ETH_DMASR_TPS_Fetching                 (0x001U << ETH_DMASR_TPS_Pos) ///< Running - fetching the Tx descriptor
#define ETH_DMASR_TPS_Waiting                  (0x002U << ETH_DMASR_TPS_Pos) ///< Running - waiting for status
#define ETH_DMASR_TPS_Reading                  (0x003U << ETH_DMASR_TPS_Pos) ///< Running - reading the data from host memory
#define ETH_DMASR_TPS_Suspended                (0x006U << ETH_DMASR_TPS_Pos) ///< Suspended - Tx Descriptor unavailabe
#define ETH_DMASR_TPS_Closing                  (0x007U << ETH_DMASR_TPS_Pos) ///< Running - closing Rx descriptor
#define ETH_DMASR_RPS_Pos                      (17)
#define ETH_DMASR_RPS                          (0x07U << ETH_DMASR_RPS_Pos)  ///< Receive process state
#define ETH_DMASR_RPS_Stopped                  (0x00U << ETH_DMASR_RPS_Pos)  ///< Stopped - Reset or Stop Rx Command issued
#define ETH_DMASR_RPS_Fetching                 (0x01U << ETH_DMASR_RPS_Pos)  ///< Running - fetching the Rx descriptor
#define ETH_DMASR_RPS_Waiting                  (0x03U << ETH_DMASR_RPS_Pos)  ///< Running - waiting for packet
#define ETH_DMASR_RPS_Suspended                (0x04U << ETH_DMASR_RPS_Pos)  ///< Suspended - Rx Descriptor unavailable
#define ETH_DMASR_RPS_Closing                  (0x05U << ETH_DMASR_RPS_Pos)  ///< Running - closing descriptor
#define ETH_DMASR_RPS_Queuing                  (0x07U << ETH_DMASR_RPS_Pos)  ///< Running - queuing the recieve frame into host memory
#define ETH_DMASR_NIS_Pos                      (16)
#define ETH_DMASR_NIS                          (0x01U << ETH_DMASR_NIS_Pos)  ///< Normal interrupt summary
#define ETH_DMASR_AIS_Pos                      (15)
#define ETH_DMASR_AIS                          (0x01U << ETH_DMASR_AIS_Pos)  ///< Abnormal interrupt summary
#define ETH_DMASR_ERS_Pos                      (14)
#define ETH_DMASR_ERS                          (0x01U << ETH_DMASR_ERS_Pos)  ///< Early receive status
#define ETH_DMASR_FBES_Pos                     (13)
#define ETH_DMASR_FBES                         (0x01U << ETH_DMASR_FBES_Pos) ///< Fatal bus error status
#define ETH_DMASR_ETS_Pos                      (10)
#define ETH_DMASR_ETS                          (0x01U << ETH_DMASR_ETS_Pos)  ///< Early transmit status
#define ETH_DMASR_RWTS_Pos                     (9)
#define ETH_DMASR_RWTS                         (0x01U << ETH_DMASR_RWTS_Pos) ///< Receive watchdog timeout status
#define ETH_DMASR_RPSS_Pos                     (8)
#define ETH_DMASR_RPSS                         (0x01U << ETH_DMASR_RPSS_Pos) ///< Receive process stopped status
#define ETH_DMASR_RBUS_Pos                     (7)
#define ETH_DMASR_RBUS                         (0x01U << ETH_DMASR_RBUS_Pos) ///< Receive buffer unavailable status
#define ETH_DMASR_RS_Pos                       (6)
#define ETH_DMASR_RS                           (0x01U << ETH_DMASR_RS_Pos)   ///< Receive status
#define ETH_DMASR_UNS_Pos                      (5)
#define ETH_DMASR_UNS                          (0x01U << ETH_DMASR_UNS_Pos)  ///< Transmit underflow status
#define ETH_DMASR_OVS_Pos                      (4)
#define ETH_DMASR_OVS                          (0x01U << ETH_DMASR_OVS_Pos)  ///< Receive overflow status
#define ETH_DMASR_TJTS_Pos                     (3)
#define ETH_DMASR_TJTS                         (0x01U << ETH_DMASR_TJTS_Pos) ///< Transmit jabber timeout status
#define ETH_DMASR_TBUS_Pos                     (2)
#define ETH_DMASR_TBUS                         (0x01U << ETH_DMASR_TBUS_Pos) ///< Transmit buffer unavailable status
#define ETH_DMASR_TPSS_Pos                     (1)
#define ETH_DMASR_TPSS                         (0x01U << ETH_DMASR_TPSS_Pos) ///< Transmit process stopped status
#define ETH_DMASR_TS_Pos                       (0)
#define ETH_DMASR_TS                           (0x01U << ETH_DMASR_TS_Pos)   ///< Transmit status

//legacy define
#define ETH_DMASR_TUS                          ETH_DMASR_UNS
#define ETH_DMASR_ROS                          ETH_DMASR_OVS

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMAMDR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMAMDR_DTCOE_Pos                   (26)
#define ETH_DMAMDR_DTCOE                       (0x01U << ETH_DMAMDR_DTCOE_Pos) ///< Drop of TCP/IP Checksum Error Frame
#define ETH_DMAMDR_RSF_Pos                     (25)
#define ETH_DMAMDR_RSF                         (0x01U << ETH_DMAMDR_RSF_Pos)   ///< Receive Store & Forward
#define ETH_DMAMDR_DFRF_Pos                    (24)
#define ETH_DMAMDR_DFRF                        (0x01U << ETH_DMAMDR_DFRF_Pos)  ///< Disable Flush of Receive Frame
#define ETH_DMAMDR_TSF_Pos                     (21)
#define ETH_DMAMDR_TSF                         (0x01U << ETH_DMAMDR_TSF_Pos)   ///< Transmit store and forward
#define ETH_DMAMDR_FTF_Pos                     (20)
#define ETH_DMAMDR_FTF                         (0x01U << ETH_DMAMDR_FTF_Pos)   ///< Flush transmit FIFO
#define ETH_DMAMDR_TTC_Pos                     (14)
#define ETH_DMAMDR_TTC                         (0x07U << ETH_DMAMDR_TTC_Pos)   ///< Transmit threshold control
#define ETH_DMAMDR_TTC_64Bytes                 (0x00U << ETH_DMAMDR_TTC_Pos)   ///< threshold level of the MTL Transmit FIFO is 64 Bytes
#define ETH_DMAMDR_TTC_128Bytes                (0x01U << ETH_DMAMDR_TTC_Pos)   ///< threshold level of the MTL Transmit FIFO is 128 Bytes
#define ETH_DMAMDR_TTC_192Bytes                (0x02U << ETH_DMAMDR_TTC_Pos)   ///< threshold level of the MTL Transmit FIFO is 192 Bytes
#define ETH_DMAMDR_TTC_256Bytes                (0x03U << ETH_DMAMDR_TTC_Pos)   ///< threshold level of the MTL Transmit FIFO is 256 Bytes
#define ETH_DMAMDR_TTC_40Bytes                 (0x04U << ETH_DMAMDR_TTC_Pos)   ///< threshold level of the MTL Transmit FIFO is 40 Bytes
#define ETH_DMAMDR_TTC_32Bytes                 (0x05U << ETH_DMAMDR_TTC_Pos)   ///< threshold level of the MTL Transmit FIFO is 32 Bytes
#define ETH_DMAMDR_TTC_24Bytes                 (0x06U << ETH_DMAMDR_TTC_Pos)   ///< threshold level of the MTL Transmit FIFO is 24 Bytes
#define ETH_DMAMDR_TTC_16Bytes                 (0x07U << ETH_DMAMDR_TTC_Pos)   ///< threshold level of the MTL Transmit FIFO is 16 Bytes
#define ETH_DMAMDR_ST_Pos                      (13)
#define ETH_DMAMDR_ST                          (0x01U << ETH_DMAMDR_ST_Pos)    ///< Start/stop transmission command
#define ETH_DMAMDR_FEF_Pos                     (7)
#define ETH_DMAMDR_FEF                         (0x01U << ETH_DMAMDR_FEF_Pos)   ///< Forward error frames
#define ETH_DMAMDR_FUGF_Pos                    (6)
#define ETH_DMAMDR_FUGF                        (0x01U << ETH_DMAMDR_FUGF_Pos)  ///< Forward undersized good frames
#define ETH_DMAMDR_DGF_Pos                     (5)
#define ETH_DMAMDR_DGF                         (0x01U << ETH_DMAMDR_DGF_Pos)   ///< Drop Giant Frame
#define ETH_DMAMDR_RTC_Pos                     (3)
#define ETH_DMAMDR_RTC                         (0x03U << ETH_DMAMDR_RTC_Pos)   ///< receive threshold control
#define ETH_DMAMDR_RTC_64Bytes                 (0x00U << ETH_DMAMDR_RTC_Pos)   ///< threshold level of the MTL Receive FIFO is 64 Bytes
#define ETH_DMAMDR_RTC_32Bytes                 (0x01U << ETH_DMAMDR_RTC_Pos)   ///< threshold level of the MTL Receive FIFO is 32 Bytes
#define ETH_DMAMDR_RTC_96Bytes                 (0x02U << ETH_DMAMDR_RTC_Pos)   ///< threshold level of the MTL Receive FIFO is 96 Bytes
#define ETH_DMAMDR_RTC_128Bytes                (0x03U << ETH_DMAMDR_RTC_Pos)   ///< threshold level of the MTL Receive FIFO is 128 Bytes
#define ETH_DMAMDR_OSF_Pos                     (2)
#define ETH_DMAMDR_OSF                         (0x01U << ETH_DMAMDR_OSF_Pos)   ///< operate on second frame
#define ETH_DMAMDR_SR_Pos                      (1)
#define ETH_DMAMDR_SR                          (0x01U << ETH_DMAMDR_SR_Pos)    ///< Start/stop receive

//legacy define
#define ETH_DMAOMR_TSF_Pos                     ETH_DMAMDR_TSF_Pos
#define ETH_DMAOMR_TSF                         ETH_DMAMDR_TSF
#define ETH_DMAOMR_FTF_Pos                     ETH_DMAMDR_FTF_Pos
#define ETH_DMAOMR_FTF                         ETH_DMAMDR_FTF
#define ETH_DMAOMR_TTC_Pos                     ETH_DMAMDR_TTC_Pos
#define ETH_DMAOMR_TTC                         ETH_DMAMDR_TTC
#define ETH_DMAOMR_TTC_64Bytes                 ETH_DMAMDR_TTC_64Bytes
#define ETH_DMAOMR_TTC_128Bytes                ETH_DMAMDR_TTC_128Bytes
#define ETH_DMAOMR_TTC_192Bytes                ETH_DMAMDR_TTC_192Bytes
#define ETH_DMAOMR_TTC_256Bytes                ETH_DMAMDR_TTC_256Bytes
#define ETH_DMAOMR_TTC_40Bytes                 ETH_DMAMDR_TTC_40Bytes
#define ETH_DMAOMR_TTC_32Bytes                 ETH_DMAMDR_TTC_32Bytes
#define ETH_DMAOMR_TTC_24Bytes                 ETH_DMAMDR_TTC_24Bytes
#define ETH_DMAOMR_TTC_16Bytes                 ETH_DMAMDR_TTC_16Bytes
#define ETH_DMAOMR_ST_Pos                      ETH_DMAMDR_ST_Pos
#define ETH_DMAOMR_ST                          ETH_DMAMDR_ST
#define ETH_DMAOMR_FEF_Pos                     ETH_DMAMDR_FEF_Pos
#define ETH_DMAOMR_FEF                         ETH_DMAMDR_FEF
#define ETH_DMAOMR_FUGF_Pos                    ETH_DMAMDR_FUGF_Pos
#define ETH_DMAOMR_FUGF                        ETH_DMAMDR_FUGF
#define ETH_DMAOMR_RTC_Pos                     ETH_DMAMDR_RTC_Pos
#define ETH_DMAOMR_RTC                         ETH_DMAMDR_RTC
#define ETH_DMAOMR_RTC_64Bytes                 ETH_DMAMDR_RTC_64Bytes
#define ETH_DMAOMR_RTC_32Bytes                 ETH_DMAMDR_RTC_32Bytes
#define ETH_DMAOMR_RTC_96Bytes                 ETH_DMAMDR_RTC_96Bytes
#define ETH_DMAOMR_RTC_128Bytes                ETH_DMAMDR_RTC_128Bytes
#define ETH_DMAOMR_OSF_Pos                     ETH_DMAMDR_OSF_Pos
#define ETH_DMAOMR_OSF                         ETH_DMAMDR_OSF
#define ETH_DMAOMR_SR_Pos                      ETH_DMAMDR_SR_Pos
#define ETH_DMAOMR_SR                          ETH_DMAMDR_SR

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMAIR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMAIR_NIE_Pos                      (16)
#define ETH_DMAIR_NIE                          (0x01U << ETH_DMAIR_NIE_Pos) ///< Normal interrupt summary enable
#define ETH_DMAIR_AIE_Pos                      (15)
#define ETH_DMAIR_AIE                          (0x01U << ETH_DMAIR_AIE_Pos) ///< Abnormal interrupt summary enable
#define ETH_DMAIR_ERE_Pos                      (14)
#define ETH_DMAIR_ERE                          (0x01U << ETH_DMAIR_ERE_Pos) ///< Early receive interrupt enable
#define ETH_DMAIR_FBE_Pos                      (13)
#define ETH_DMAIR_FBE                          (0x01U << ETH_DMAIR_FBE_Pos) ///< Fatal bus error interrupt enable
#define ETH_DMAIR_ETE_Pos                      (10)
#define ETH_DMAIR_ETE                          (0x01U << ETH_DMAIR_ETE_Pos) ///< Early transmit interrupt enable
#define ETH_DMAIR_RWE_Pos                      (9)
#define ETH_DMAIR_RWE                          (0x01U << ETH_DMAIR_RWE_Pos) ///< Receive watchdog timeout interrupt enable
#define ETH_DMAIR_RSE_Pos                      (8)
#define ETH_DMAIR_RSE                          (0x01U << ETH_DMAIR_RSE_Pos) ///< Receive process stopped interrupt enable
#define ETH_DMAIR_RUE_Pos                      (7)
#define ETH_DMAIR_RUE                          (0x01U << ETH_DMAIR_RUE_Pos) ///< Receive buffer unavailable interrupt enable
#define ETH_DMAIR_RCE_Pos                      (6)
#define ETH_DMAIR_RCE                          (0x01U << ETH_DMAIR_RCE_Pos) ///< Receive interrupt enable
#define ETH_DMAIR_UNE_Pos                      (5)
#define ETH_DMAIR_UNE                          (0x01U << ETH_DMAIR_UNE_Pos) ///< Transmit Underflow interrupt enable
#define ETH_DMAIR_OVE_Pos                      (4)
#define ETH_DMAIR_OVE                          (0x01U << ETH_DMAIR_OVE_Pos) ///< Receive Overflow interrupt enable
#define ETH_DMAIR_TJE_Pos                      (3)
#define ETH_DMAIR_TJE                          (0x01U << ETH_DMAIR_TJE_Pos) ///< Transmit jabber timeout interrupt enable
#define ETH_DMAIR_TUE_Pos                      (2)
#define ETH_DMAIR_TUE                          (0x01U << ETH_DMAIR_TUE_Pos) ///< Transmit buffer unavailable interrupt enable
#define ETH_DMAIR_TSE_Pos                      (1)
#define ETH_DMAIR_TSE                          (0x01U << ETH_DMAIR_TSE_Pos) ///< Transmit process stopped interrupt enable
#define ETH_DMAIR_TCE_Pos                      (0)
#define ETH_DMAIR_TCE                          (0x01U << ETH_DMAIR_TCE_Pos) ///< Transmit interrupt enable

//legacy define
#define ETH_DMAIER_NISE_Pos                    ETH_DMAIR_NIE_Pos
#define ETH_DMAIER_NISE                        ETH_DMAIR_NIE
#define ETH_DMAIER_AISE_Pos                    ETH_DMAIR_AIE_Pos
#define ETH_DMAIER_AISE                        ETH_DMAIR_AIE
#define ETH_DMAIER_ERIE_Pos                    ETH_DMAIR_ERE_Pos
#define ETH_DMAIER_ERIE                        ETH_DMAIR_ERE
#define ETH_DMAIER_FBEIE_Pos                   ETH_DMAIR_FBE_Pos
#define ETH_DMAIER_FBEIE                       ETH_DMAIR_FBE
#define ETH_DMAIER_ETIE_Pos                    ETH_DMAIR_ETE_Pos
#define ETH_DMAIER_ETIE                        ETH_DMAIR_ETE
#define ETH_DMAIER_RWTIE_Pos                   ETH_DMAIR_RWE_Pos
#define ETH_DMAIER_RWTIE                       ETH_DMAIR_RWE
#define ETH_DMAIER_RPSIE_Pos                   ETH_DMAIR_RSE_Pos
#define ETH_DMAIER_RPSIE                       ETH_DMAIR_RSE
#define ETH_DMAIER_RBUIE_Pos                   ETH_DMAIR_RUE_Pos
#define ETH_DMAIER_RBUIE                       ETH_DMAIR_RUE
#define ETH_DMAIER_RIE_Pos                     ETH_DMAIR_RCE_Pos
#define ETH_DMAIER_RIE                         ETH_DMAIR_RCE
#define ETH_DMAIER_TUIE_Pos                    ETH_DMAIR_UNE_Pos
#define ETH_DMAIER_TUIE                        ETH_DMAIR_UNE
#define ETH_DMAIER_ROIE_Pos                    ETH_DMAIR_OVE_Pos
#define ETH_DMAIER_ROIE                        ETH_DMAIR_OVE
#define ETH_DMAIER_TJTIE_Pos                   ETH_DMAIR_TJE_Pos
#define ETH_DMAIER_TJTIE                       ETH_DMAIR_TJE
#define ETH_DMAIER_TBUIE_Pos                   ETH_DMAIR_TUE_Pos
#define ETH_DMAIER_TBUIE                       ETH_DMAIR_TUE
#define ETH_DMAIER_TPSIE_Pos                   ETH_DMAIR_TSE_Pos
#define ETH_DMAIER_TPSIE                       ETH_DMAIR_TSE
#define ETH_DMAIER_TIE_Pos                     ETH_DMAIR_TCE_Pos
#define ETH_DMAIER_TIE                         ETH_DMAIR_TCE

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMAFLCR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMAFLCR_OVFF_Pos                   (28)
#define ETH_DMAFLCR_OVFF                       (0x01U << ETH_DMAFLCR_OVFF_Pos)   ///< OVF Count Overflow Flag

#define ETH_DMAFLCR_OVFC_Pos                   (17)
#define ETH_DMAFLCR_OVFC                       (0x7FFU << ETH_DMAFLCR_OVFC_Pos)  ///< OVF Count

#define ETH_DMAFLCR_BUAF_Pos                   (16)
#define ETH_DMAFLCR_BUAF                       (0x01U << ETH_DMAFLCR_BUAF_Pos)   ///< BUA Count Overflow Flag

#define ETH_DMAFLCR_BUAC_Pos                   (0)
#define ETH_DMAFLCR_BUAC                       (0xFFFFU << ETH_DMAFLCR_BUAC_Pos) ///< BUA Count Overflow Flag

//legacy define
#define ETH_DMAMFBOCR_OFOC_Pos                 ETH_DMAFLCR_OVFF_Pos
#define ETH_DMAMFBOCR_OFOC                     ETH_DMAFLCR_OVFF

#define ETH_DMAMFBOCR_MFA_Pos                  ETH_DMAFLCR_OVFC_Pos
#define ETH_DMAMFBOCR_MFA                      ETH_DMAFLCR_OVFC

