wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_enet.h
#define ETH_DMAMFBOCR_OMFC_Pos                 ETH_DMAFLCR_BUAF_Pos
#define ETH_DMAMFBOCR_OMFC                     ETH_DMAFLCR_BUAF

#define ETH_DMAMFBOCR_MFC_Pos                  ETH_DMAFLCR_BUAC_Pos
#define ETH_DMAMFBOCR_MFC                      ETH_DMAFLCR_BUAC

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMAWDTR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMAWDTR_RIWT_Pos                   (0)
#define ETH_DMAWDTR_RIWT                       (0xFFU << ETH_DMAWDTR_RIWT_Pos) ///< Receive Interrupt Watchdog Timer Counter

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMACURTXDSAR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMACURTXDSAR_CURTXDSA              (0xFFFFFFFFU) ///< Current Transfer Descriptor Address
//legacy define
#define ETH_DMACHTDR_HTDAP                     ETH_DMACURTXDSAR_CURTXDSA

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMACURRXDSAR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMACURRXDSAR_CURRXDSA              (0xFFFFFFFFU) ///< Current Receive Descriptor Address
//legacy define
#define ETH_DMACHRDR_HRDAP                     ETH_DMACURRXDSAR_CURRXDSA

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMACURTXBFAR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMACURTXBFAR_CURTXBFA              (0xFFFFFFFFU) ///< Current Transfer Buffer Address
//legacy define
#define ETH_DMACHTBAR_HTBAP                    ETH_DMACURTXBFAR_CURTXBFA

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_DMACURRXBFAR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_DMACURRXBFAR_CURRXBFA              (0xFFFFFFFFU) ///< Current Receive Buffer Address
//legacy define
#define ETH_DMACHRBAR_HRBAP                    ETH_DMACURRXBFAR_CURRXBFA

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPCR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPCR_PTPDAF_Pos                   (18)
#define ETH_PTPCR_PTPDAF                       (0x01U << ETH_PTPCR_PTPDAF_Pos)  ///< PTP DA Filter
#define ETH_PTPCR_PTPTYPS_Pos                  (14)
#define ETH_PTPCR_PTPTYPS                      (0x0FU << ETH_PTPCR_PTPTYPS_Pos) ///< PTP Message Type
#define ETH_PTPCR_PTPIPV4_Pos                  (13)
#define ETH_PTPCR_PTPIPV4                      (0xFFU << ETH_PTPCR_PTPIPV4_Pos) ///< PTP Over UDP-IPv4
#define ETH_PTPCR_PTPIPV6_Pos                  (12)
#define ETH_PTPCR_PTPIPV6                      (0xFFU << ETH_PTPCR_PTPIPV6_Pos) ///< PTP Over UDP-IPv6
#define ETH_PTPCR_PTPETH_Pos                   (11)
#define ETH_PTPCR_PTPETH                       (0xFFU << ETH_PTPCR_PTPETH_Pos)  ///< PTP Over Ethernet
#define ETH_PTPCR_PTPVER_Pos                   (10)
#define ETH_PTPCR_PTPVER                       (0xFFU << ETH_PTPCR_PTPVER_Pos)  ///< PTP Version
#define ETH_PTPCR_PTPNSS_Pos                   (9)
#define ETH_PTPCR_PTPNSS                       (0xFFU << ETH_PTPCR_PTPNSS_Pos)  ///< PTP Nanosecond Select
#define ETH_PTPCR_PTPEALL_Pos                  (8)
#define ETH_PTPCR_PTPEALL                      (0xFFU << ETH_PTPCR_PTPEALL_Pos) ///< PTP Timestamp Enable All
#define ETH_PTPCR_PTPADUP_Pos                  (5)
#define ETH_PTPCR_PTPADUP                      (0xFFU << ETH_PTPCR_PTPADUP_Pos) ///< PTP Addend Update
#define ETH_PTPCR_PTPINT_Pos                   (4)
#define ETH_PTPCR_PTPINT                       (0xFFU << ETH_PTPCR_PTPINT_Pos)  ///< PTP Interrupt Enable
#define ETH_PTPCR_PTPUP_Pos                    (3)
#define ETH_PTPCR_PTPUP                        (0xFFU << ETH_PTPCR_PTPUP_Pos)   ///< PTP Second/Nanosecond Update
#define ETH_PTPCR_PTPINI_Pos                   (2)
#define ETH_PTPCR_PTPINI                       (0xFFU << ETH_PTPCR_PTPINI_Pos)  ///< PTP Interrupt Enable
#define ETH_PTPCR_PTPCS_Pos                    (1)
#define ETH_PTPCR_PTPCS                        (0xFFU << ETH_PTPCR_PTPCS_Pos)   ///< PTP Addend Update
#define ETH_PTPCR_PTPEN_Pos                    (0)
#define ETH_PTPCR_PTPEN                        (0xFFU << ETH_PTPCR_PTPEN_Pos)   ///< PTP Interrupt Enable

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPNSAR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPNSAR_NSADD_Pos                  (0)
#define ETH_PTPNSAR_NSADD                      (0xFFU << ETH_PTPNSAR_NSADD_Pos) ///< Nanosecond Addend

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPSBSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPSBSR_SBSEC_Pos                  (0)
#define ETH_PTPSBSR_SBSEC                      (0xFFFFFFFFU << ETH_PTPNSAR_SBSEC_Pos) ///< System Base Second

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPSNSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPSNSR_SNSEC_Pos                  (0)
#define ETH_PTPSNSR_SNSEC                      (0x7FFFFFFFU << ETH_PTPSNSR_SNSEC_Pos) ///< System Nanosecond

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPUBSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPUBSR_UBSEC_Pos                  (0)
#define ETH_PTPUBSR_UBSEC                      (0xFFFFFFFFU << ETH_PTPUBSR_UBSEC_Pos) ///< Updata Base Second

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPUNSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPUNSR_UPNSEC_Pos                 (31)
#define ETH_PTPUNSR_UPNSEC                     (0x01U << ETH_PTPUNSR_UPNSEC_Pos)      ///< Update Nanosecond Select
#define ETH_PTPUNSR_UNSEC_Pos                  (0)
#define ETH_PTPUNSR_UNSEC                      (0x7FFFFFFFU << ETH_PTPUNSR_UNSEC_Pos) ///< Update Nanosecond

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPBSAR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPBSAR_BSADD_Pos                  (0)
#define ETH_PTPBSAR_BSADD                      (0xFFFFFFFFU << ETH_PTPBSAR_BSADD_Pos) ///< Base Addend

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPTBSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPTBSR_TBSEC_Pos                  (0)
#define ETH_PTPTBSR_TBSEC                      (0xFFFFFFFFU << ETH_PTPTBSR_TBSEC_Pos) ///< Target Base Second

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPTNSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPTNSR_TNSEC_Pos                  (0)
#define ETH_PTPTNSR_TNSEC                      (0x7FFFFFFFU << ETH_PTPTNSR_TNSEC_Pos) ///< target nanosecond
//legacy define
#define ETH_PTPTNSR_TBSEC_Pos                  ETH_PTPTNSR_TNSEC_Pos
#define ETH_PTPTNSR_TBSEC                      ETH_PTPTNSR_TNSEC

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPSR_TSER1_Pos                    (5)
#define ETH_PTPSR_TSER1                        (0x01U << ETH_PTPSR_TSER1_Pos) ///< Target Second Error 1
#define ETH_PTPSR_TSTA1_Pos                    (4)
#define ETH_PTPSR_TSTA1                        (0x01U << ETH_PTPSR_TSTA1_Pos) ///< Target Second Time Arrived 1
#define ETH_PTPSR_TSER0_Pos                    (3)
#define ETH_PTPSR_TSER0                        (0x01U << ETH_PTPSR_TSER0_Pos) ///< Target Second Error 0
#define ETH_PTPSR_TSTA0_Pos                    (1)
#define ETH_PTPSR_TSTA0                        (0x01U << ETH_PTPSR_TSTA0_Pos) ///< Target Second Time Arrived 0
#define ETH_PTPSR_TSOVF_Pos                    (0)
#define ETH_PTPSR_TSOVF                        (0x01U << ETH_PTPSR_TSOVF_Pos) ///< Timestamp Overflow

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_PTPPPSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_PTPPPSR_TTSEL1_Pos                 (13)
#define ETH_PTPPPSR_TTSEL1                     (0x03U << ETH_PTPPPSR_TTSEL1_Pos)  ///< Target Time Event Select 1
#define ETH_PTPPPSR_TTSEL1_0                   (0x00U << ETH_PTPPPSR_TTSEL1_Pos)  ///< register 0 (ENET_PTPTBSR0/ENET_PTPTNSR0) is only used for interrupt outputevents
#define ETH_PTPPPSR_TTSEL1_2                   (0x02U << ETH_PTPPPSR_TTSEL1_Pos)  ///< register 0 is used for interrupt output events and PPS0 single output event
#define ETH_PTPPPSR_TTSEL1_3                   (0x03U << ETH_PTPPPSR_TTSEL1_Pos)  ///< register 0(ENET_PTPTBSR0/ENET_PTPTNSR0) is only used for PPS0 single output event

