wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_enet.h
#define ETH_PTPPPSR_PPSOUT1_Pos                (8)
#define ETH_PTPPPSR_PPSOUT1                    (0x07U << ETH_PTPPPSR_PPSOUT1_Pos) ///< PPS Output Control 1

#define ETH_PTPPPSR_TTSEL0_Pos                 (5)
#define ETH_PTPPPSR_TTSEL0                     (0x03U << ETH_PTPPPSR_TTSEL0_Pos)  ///< Target Time Event Select 0
#define ETH_PTPPPSR_TTSEL0_0                   (0x00U << ETH_PTPPPSR_TTSEL0_Pos)  ///< register 0 (ENET_PTPTBSR0/ENET_PTPTNSR0) is only used for interrupt outputevents
#define ETH_PTPPPSR_TTSEL0_2                   (0x02U << ETH_PTPPPSR_TTSEL0_Pos)  ///< register 0 is used for interrupt output events and PPS0 single output event
#define ETH_PTPPPSR_TTSEL0_3                   (0x03U << ETH_PTPPPSR_TTSEL0_Pos)  ///< register 0(ENET_PTPTBSR0/ENET_PTPTNSR0) is only used for PPS0 single output event
#define ETH_PTPPPSR_PPSOMD_Pos                 (4)
#define ETH_PTPPPSR_PPSOMD                     (0x01U << ETH_PTPPPSR_PPSOMD_Pos)  ///< PPS Output Mode
#define ETH_PTPPPSR_PPSOUT0_Pos                (0)
#define ETH_PTPPPSR_PPSOUT0                    (0x0FU << ETH_PTPPPSR_PPSOUT0_Pos) ///< PPS Output Control 0

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCCR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCCR_CPSEL_Pos                    (5)
#define ETH_MMCCR_CPSEL                        (0x01U << ETH_MMCCR_CPSEL_Pos) ///< Remote-Wakeup Filter Value
#define ETH_MMCCR_CPSET_Pos                    (4)
#define ETH_MMCCR_CPSET                        (0x01U << ETH_MMCCR_CPSET_Pos) ///< Counter Preset Setting
#define ETH_MMCCR_CFIX_Pos                     (3)
#define ETH_MMCCR_CFIX                         (0x01U << ETH_MMCCR_CFIX_Pos)  ///< Counter Fixed
#define ETH_MMCCR_CRRST_Pos                    (2)
#define ETH_MMCCR_CRRST                        (0x01U << ETH_MMCCR_CRRST_Pos) ///< Counter Reset after Read
#define ETH_MMCCR_COSR_Pos                     (1)
#define ETH_MMCCR_COSR                         (0x01U << ETH_MMCCR_COSR_Pos)  ///< Counter Overflow Stop Rollover
#define ETH_MMCCR_CRST_Pos                     (0)
#define ETH_MMCCR_CRST                         (0x01U << ETH_MMCCR_CRST_Pos)  ///< Counter Reset

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCRSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCRSR_RUGIS_Pos                   (17)
#define ETH_MMCRSR_RUGIS                       (0x01U << ETH_MMCRSR_RUGIS_Pos)   ///< Receive Unicast Good Frame Interrupt Status

#define ETH_MMCRSR_RALIEIS_Pos                 (6)
#define ETH_MMCRSR_RALIEIS                     (0x01U << ETH_MMCRSR_RALIEIS_Pos) ///< Receive Align Error Frame Interrupt Status
#define ETH_MMCRSR_RCRCEIS_Pos                 (5)
#define ETH_MMCRSR_RCRCEIS                     (0x01U << ETH_MMCRSR_RCRCEIS_Pos) ///< Receive CRC Error Frame Interrupt Status

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCTSR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCTSR_TAGIS_Pos                   (21)
#define ETH_MMCTSR_TAGIS                       (0x01U << ETH_MMCTSR_TAGIS_Pos)  ///< Transfer All Good Frame Interrupt Status

#define ETH_MMCTSR_TGMCIS_Pos                  (15)
#define ETH_MMCTSR_TGMCIS                      (0x01U << ETH_MMCTSR_TGMCIS_Pos) ///< Transfer Good Frame after Multi-Collision Interrupt Status
#define ETH_MMCTSR_TGSCIS_Pos                  (14)
#define ETH_MMCTSR_TGSCIS                      (0x01U << ETH_MMCTSR_TGSCIS_Pos) ///< Transfer Good Frame after Single-Collision Interrupt Status

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCRIR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCRIR_RUGIM_Pos                   (17)
#define ETH_MMCRIR_RUGIM                       (0x01U << ETH_MMCRIR_RUGIM_Pos)   ///< Receive Unicast Good Frame Interrupt Mask
#define ETH_MMCRIR_RALIEIM_Pos                 (6)
#define ETH_MMCRIR_RALIEIM                     (0x01U << ETH_MMCRIR_RALIEIM_Pos) ///< Receive Align Error Frame Interrupt Mask
#define ETH_MMCRIR_RCRCEIM_Pos                 (5)
#define ETH_MMCRIR_RCRCEIM                     (0x01U << ETH_MMCRIR_RCRCEIM_Pos) ///< Receive CRC Error Frame Interrupt Mask

////////////////////////////////////////////////////////////////////////////////
/// @brief ETH_MMCTIR Registers bits definition
////////////////////////////////////////////////////////////////////////////////
#define ETH_MMCTIR_TAGIM_Pos                   (21)
#define ETH_MMCTIR_TAGIM                       (0x01U << ETH_MMCTIR_TAGIM_Pos)  ///< Transfer All Good Frame Interrupt Mask
#define ETH_MMCTIR_TGMCIM_Pos                  (15)
#define ETH_MMCTIR_TGMCIM                      (0x01U << ETH_MMCTIR_TGMCIM_Pos) ///< Transfer Good Frame after Multi-Collision Interrupt Mask
#define ETH_MMCTIR_TGSCIM_Pos                  (14)
#define ETH_MMCTIR_TGSCIM                      (0x01U << ETH_MMCTIR_TGSCIM_Pos) ///< Transfer Good Frame after Single-Collision Interrupt Mask

/// @}

/// @}

/// @}

#endif

